#include<stdlib.h>
#include<stdio.h>
#include<math.h>
#include<stdint.h>
#include <dirent.h>
#include <sys/stat.h>
#include <sys/types.h>
#include <unistd.h>
typedef struct Bmpheader {
	char identifier[2]; // 0x0000
	unsigned int filesize; // 0x0002
	unsigned short reserved; // 0x0006
	unsigned short reserved2;
	unsigned int bitmap_dataoffset; // 0x000A
	unsigned int bitmap_headersize; // 0x000E
	unsigned int width; // 0x0012
	unsigned int height; // 0x0016
	unsigned short planes; // 0x001A
	unsigned short bits_perpixel; // 0x001C
	unsigned int compression; // 0x001E
	unsigned int bitmap_datasize; // 0x0022
	unsigned int hresolution; // 0x0026
	unsigned int vresolution; // 0x002A
	unsigned int usedcolors; // 0x002E
	unsigned int importantcolors; // 0x0032
} Bitmap;

typedef struct Pixel{
	unsigned char*data;
}Pixel;

typedef struct Img{
	Bitmap header;
	unsigned char*palette;
	Pixel**pixels;
}Img;
typedef struct RLE_node{
	short val;
	struct RLE_node*next;
}RLE_node;
unsigned char**malloc_2D_uchar(int row,int col);
void print_header(Img img);
void ImWrite(Img img,char filename[]);
Pixel** malloc_2D_Pixel(int row, int col,unsigned short bytes_perpixel);
double**malloc_2D_double(int row_size,int col_size);
short****malloc_4D_short(int size1,int size2,int size3,int size4);
RLE_node***malloc_3D_RLE_node(int M,int N);
short***malloc_3D_short(int size1,int size2,int size3);

void RLE_8x8(short*F_zigzag,RLE_node*list);
RLE_node*new_RLE_node(short val);
void add_RLE_node(RLE_node*last,RLE_node*newnode);

double**ones(int row,int col);
void reverse_row(Pixel**arr,int rowSize,int colSize);
void readHeader_txt(Img*img,char*filename);
void read_table_txt(double table[8][8],char*filename);
