#include<stdlib.h>
#include<stdio.h>
#include<math.h>
#include<stdint.h>
#include <dirent.h>
#include <sys/stat.h>
#include <sys/types.h>
#include <unistd.h>
typedef struct Bmpheader {
	char identifier[2]; // 0x0000
	unsigned int filesize; // 0x0002
	unsigned short reserved; // 0x0006
	unsigned short reserved2;
	unsigned int bitmap_dataoffset; // 0x000A
	unsigned int bitmap_headersize; // 0x000E
	unsigned int width; // 0x0012
	unsigned int height; // 0x0016
	unsigned short planes; // 0x001A
	unsigned short bits_perpixel; // 0x001C
	unsigned int compression; // 0x001E
	unsigned int bitmap_datasize; // 0x0022
	unsigned int hresolution; // 0x0026
	unsigned int vresolution; // 0x002A
	unsigned int usedcolors; // 0x002E
	unsigned int importantcolors; // 0x0032
} Bitmap;

/*construct a structure of RGB*/
typedef struct Pixel{
	unsigned char*data;
}Pixel;

typedef struct Img{
	Bitmap header;
	unsigned char*palette;
	Pixel**pixels;
}Img;

typedef struct RLE_node{
	short val;
	struct RLE_node*next;
}RLE_node;

typedef struct Huffman_node{
	short val;
	int count;
	struct Huffman_node*left;
	struct Huffman_node*right;
	struct Huffman_node*next;
}Huffman_node;

typedef struct Huffman_queue{
	struct Huffman_node*front;//表頭,不是第0個資料 
	struct Huffman_node*rear;
}Huffman_queue;

typedef struct codebook{
	short*vals;
	char**bitstream;
	int node_num;
}codebook;



int RLE_code_len(RLE_node*RLE_code);
//檔案讀寫相關 
void saveas(unsigned char**matrix,int row,int col,char*filename);
Img ImRead(char input_name[]);
void ImWrite(Img img,char filename[]);
void readheader(FILE* fp, Bitmap *x);
void savetxt_table_8x8(int arr[8][8],char*filename);
FILE*save_8x8_RLE_txt(FILE*fptr,short*list);
